{
  "recipes": [
    { 
      "title": "Everything Cream Cheese Crispbreads",
      "tags": [
        "Snack", 
        "Gluten Free"
      ],
      "ingredients": [
        "TJ's Gluten Free Crispbreads",
        "TJ's Whipped Cream Cheese",
        "TJ's Everything But The Bagel Sesame Seasoning Blend",
        "Fresh Dill, for garnish (optional)"
      ],
      "directions": "Generously slather a crispbread with cream cheese. Sprinkle liberally with seasoning blend and top with fresh dill. \nEnjoy!"
    },
    {
      "title": "Citrus Garlic Chicken Tacos",
      "tags": "Quick Meal",
      "ingredients": [
        "1 package TJ’s Cuban Style Citrus Garlic Bowl",
        "1 package TJ’s Corn & Wheat Tortillas",
        "TJ’s Island Salsa",
        "TJ’s Cilantro (for optional garnish)",
        "1 TJ’s Jalapeño, sliced (for optional garnish)"
      ],
      "directions": "Remove outer packaging of Cuban Style Citrus Garlic Bowl and pierce film. Microwave on high 4 to 5 minutes or until heated through. Stir and set aside.\nFill tortillas with warmed Cuban Style Citrus Garlic Bowl. Garnish with salsa, sliced jalapeños, and cilantro.\nEnjoy!"
    },
    {
      "title": "Chimichurri Soup",
      "tags": "Quick Meal",
      "ingredients": [
        "2 packages TJ’s Organic Tomato & Roasted Red Pepper Soup",
        "1 package TJ’s Frozen Peruvian Style Chimichurri Rice",
        "1 cup TJ’s Frozen Roasted Corn",
        "Cotija Cheese (optional, for garnish)"
      ],
      "directions": "In a large pot combine soup, rice, and corn.\nStirring periodically, heat on low for about 10 min or until heated through.\nServe warm, topped with cheese if desired. \nEnjoy!"
    },
    {
      "title": "Quinoa Veggie Burgers with Avocado Tzatziki",
      "tags": "Quick Meal",
      "ingredients": [
        "1 package TJ’s Quinoa Cowboy Veggie Burgers",
        "4 TJ’s Whole Wheat Hamburger Buns",
        "1 tub TJ’s Avocado Tzatziki Dip",
        "½ TJ”s Red Onion, very thinly sliced",
        "TJ’s Fresh Cilantro, chopped"
      ],
      "directions": "Preheat oven to 450°F. Remove burgers from packaging and place on an ungreased baking sheet. Bake 5 minutes or until browned. Carefully flip and continue to bake an additional 5 minutes, or until heated through and well browned. Remove from oven and let cool slightly.\nPlace burger patty on bottom of hamburger bun. Top with a generous swipe of Avocado Tzatziki dip, followed by sliced red onion and cilantro. Top with hamburger bun and serve immediately."
    },
    {
      "title": "Pop Goes the Elote!",
      "tags": "Snack",
      "ingredients": [
        "¼ cup TJ’s Olive Oil",
        "½ cup TJ’s Organic Popping Corn",
        "3 tablespoons TJ’s Salted Butter, melted",
        "3 tablespoon TJ’s Everything but the Elote Seasoning Blend"
      ],
      "directions": "In a 3-quart pan, pour in oil to cover the bottom.  Add 2-3 kernels of corn to pan, cover and heat. When these kernels pop, add the remaining popping corn, then cover and shake pan over medium heat until popping stops. \nRemove from heat. Pour melted butter and sprinkle seasoning over popcorn. Mix until thoroughly covered.\nLet popcorn cool slightly and enjoy!"
    },
    {
      "title": "Protein Box",
      "tags": "Snack",
      "ingredients": [
        "5 TJ’s Cage Free Fresh Hard-Cooked Eggs",
        "1 bag TJ’s Organic Cut & Peeled Carrots, rinsed & dried",
        "1 bag TJ’s Organic Celery Hearts, rinsed & dried",
        "1 block TJ’s English Coastal Cheddar (or 5 TJ's Sharp Cheddar Snack Pack pre-portioned, individually-wrapped pieces of Cheddar)",
        "1 jar TJ’s Peanut Butter with Flax & Chia Seeds",
        "5 of your favorite TJ's Apples"
      ],
      "directions": "You will need food storage containers for ingredients and daily meal prep, and 5 small sauce containers for peanut butter.\nPrep components: Trim ends of celery and slice into thirds. Slice cheese into 1-inch cubes. Measure 2 tablespoons peanut butter into each of the small sauce containers. Halve eggs. Refrigerate prepped ingredients in separate food storage containers until needed.\nAssemble protein box: Each morning, place the following in your box: two egg halves, 6-7 carrots, 5-6 celery sticks, 5-6 cubes of cheese, 2 tablespoons of peanut butter, and one apple."
    },
    {
      "title": "Loaded Totchos",
      "tags": "Snack",
      "ingredients": [
        "1 bag TJ's Trader Potato Tots",
        "1 block TJ's Jalapeño Jack Cheese, shredded and divided",
        "1 can TJ's Organic Black Beans, drained",
        "1/2 batch of Jackfruit Carnitas (or 2 cups of your favorite cooked protein)",
        "TJ's Hot & Sweet Jalapeños, Sour Cream & Cilantro (for garnish)"
      ],
      "directions": "Spread tots on a large, rimmed baking pan and cook according to package directions. Remove pan from oven and set on heat-safe work surface.\nUsing tongs or a spatula, pile half of the tots in the center of the pan. Sprinkle with half of the cheese, then pile remaining tots on top. Scatter black beans, jackfruit carnitas, remaining cheese and jalapeños atop the tots. \nReturn pan to oven and cook 5-10 minutes more to melt the cheese. Remove from oven and let cool slightly. Garnish with cilantro and sour cream, and enjoy!"
    },
    {
      "title": "Fusilli Garden Pasta",
      "tags": "Gluten Free",
      "ingredients": [
        "2 cups TJ's Gluten Free Organic Brown Rice & Quinoa Fusilli Pasta",
        "1 1/2 Tablespoons of TJ's Clarified Butter (Ghee), or more",
        "1 1/2 cups trimmed and cut TJ's Asparagus (sliced into thirds)",
        "1 1/2 cups TJ's Mini Pearl Grape Tomatoes",
        "1/2 cup fresh sliced TJ's Basil (sliced into thin strips)",
        "1/2 TJ's Lemon",
        "1/2 cup TJ's Dry Toasted Pignolias (Pine Nuts)",
        "2 Tablespoons TJ's Shaved Cheese Blend"
      ],
      "directions": "Bring a large pot of water to boil, adding salt, if desired. Add 2 cups of pasta and cook uncovered, stirring occasionally for about 7-10 minutes or until al dente. Do not overcook. Remove pasta and drain thoroughly. Set aside.\nHeat a large pan over medium heat. Add 1 1/2 tablespoons of clarified butter and heat another minute or so until it starts to shimmer. Add  1 1/2 cups of sliced asparagus, stirring until all sides are coated with clarified butter. Let cook without stirring for 2-3 more minutes until asparagus edges begin to turn golden. Add 1 1/2 cups of grape tomatoes and continue stirring until tomatoes are heated through, about 2-3 minutes. Add as much cooked pasta as desired to the pan, then mix in 1/2 cup fresh sliced basil, the juice of 1/2 a lemon and 1/2 cup of pine nuts. Keep stirring until ingredients are well incorporated, about 1-2 minutes. At this point, add up to 1 tablespoon more clarified butter if desired. Stir. Divide the pasta among two plates and top with shaved cheese blend. Enjoy!"
    },
    {
      "title": "Cocoa Crunch Milkshake",
      "tags": "Gluten Free", 
      "ingredients": [
        "TJ’s Midnight Moo Chocolate Flavored Syrup",
        "1 cup TJ’s Gluten Free Cocoa Crunch Cereal, plus more for garnish",
        "1 cup TJ’s Whole Milk or TJ's Chocolate Whole Milk made with Fair Trade Cocoa",
        "TJ’s Ultra Chocolate Ice Cream",
        "Whipped Cream"
      ],
      "directions": "Coat the inside of two tall glasses with a few drizzles of chocolate syrup. Place in the freezer to chill.\nPlace cereal and milk in a bowl; refrigerate for 15 minutes to infuse. Add cereal and milk to a blender pitcher, along with 4 heaping scoops of ice cream. Blend until ingredients are fully incorporated.\nRemove glasses from freezer and divide milkshake evenly among glasses. Garnish with chipped cream, chocolate syrup and cereal. Enjoy immediately.Coat the inside of two tall glasses with a few drizzles of chocolate syrup. Place in the freezer to chill.Place cereal and milk in a bowl; refrigerate for 15 minutes to infuse. Add cereal and milk to a blender pitcher, along with 4 heaping scoops of ice cream. Blend until ingredients are fully incorporated.Remove glasses from freezer and divide milkshake evenly among glasses. Garnish with chipped cream, chocolate syrup and cereal. Enjoy immediately."
    },
    {
      "title": "Baked Apples",
      "tags": "Gluten Free",
      "ingredients": [
        "1 bag (2 pounds) TJ’s Honeycrisp Apples",
        "¾ cup TJ’s Organic Brown Sugar",
        "1/3 cup TJ’s Gluten Free Rolled Oats",
        "1/3 cup TJ’s Chopped Medjool Dates",
        "1/3 cup TJ’s Unsalted Dry Toasted Pecan Pieces",
        "1 teaspoon TJ’s Pumpkin Pie Spice (seasonal) or TJ’s Ground Cinnamon",
        "1 stick TJ’s Unsalted Butter, softened",
        "2 cups TJ’s Spiced Cider"
      ],
      "directions": "Preheat oven to 350°F. Core apples using an apple corer or sharp paring knife, making sure all of the hard core and seeds are scooped out. Set aside.\nIn a medium-sized mixing bowl, combine dates, pecans, brown sugar, oats, pumpkin pie spice, and softened butter. Stuff cored apples with the date mixture, making sure to completely fill the hole left from the core.\nPlace stuffed apples in a 9 x 13-inch baking dish and pour spiced cider into the bottom of the dish. Cover with aluminum foil and bake on center rack of oven for 30 minutes. Remove foil and continue to bake for an additional 10-20 minutes, or until apples are easily pierced with a fork.\nRemove from oven and let cool slightly. Serve warm as-is, or alongside a scoop of Trader Joe’s Super Premium French Vanilla Ice Cream."
    },
    {
      "title": "Baked Parmesan Chicken Tenders",
      "tags": "Gluten Free",
      "ingredients": [
        "1½ cups TJ’s Gluten Free Rice Crumbs",
        "TJ’s Canola Oil Spray",
        "4 TJ’s Large Eggs, whisked",
        "2/3 cup TJ’s Grated Parmesan Cheese",
        "4 teaspoons TJ’s 21 Seasoning Salute",
        "½ teaspoon TJ’s Sea Salt",
        "2 packages TJ’s Organic Chicken Breast Tenders",
        "Your favorite TJ’s Sauce for dipping (Dijon Mustard, BBQ Sauce, Green Dragon Hot Sauce…)"
      ],
      "directions": "Preheat oven to 425°F. Spread rice crumbs on a large baking sheet. Place on center rack of oven and bake 10 minutes. Remove from oven and transfer rice crumbs to a shallow bowl to cool.\nCoat baking sheet with cooking spray, set aside. Remove chicken from packaging and pat dry with paper towels, set aside.\nAdd cheese, 21 seasoning, and salt to cooled rice crumbs, set aside. In another shallow bowl, whisk eggs, set aside. One by one, dredge a chicken tender in egg, letting excess drain off before dredging in rice crumb mixture. Dredge tender once more in egg and rice crumb mixture, then transfer to prepared baking sheet. Repeat with remaining tenders.\nSpray tops of dredged chicken tenders with canola oil spray. Place baking sheet on center rack of oven and bake 15 minutes. Use tongs to flip chicken tenders and bake 8-10 minutes more, until internal temperature of chicken reaches 165°F and exterior is a light golden brown. Remove from oven and transfer chicken tenders to a wire rack to cool slightly before serving."
    }
  ]
}